FoRTE-Research/EnergyHarvestingDeviceTestbed/FE310/AES_test/bsp/design.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>sifive_fe310_g000_prci_0</name>
			<description>From sifive,fe310-g000,prci,mem peripheral generator</description>
			<baseAddress>0x10008000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x8000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>hfrosccfg</name>
					<description>Ring Oscillator Configuration and Status</description>
					<addressOffset>0x0</addressOffset>
					<fields>
						<field>
							<name>hfroscdiv</name>
							<description>Ring Oscillator Divider Register</description>
							<bitRange>[5:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>hfrosctrim</name>
							<description>Ring Oscillator Trim Register</description>
							<bitRange>[20:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>hfroscen</name>
							<description>Ring Oscillator Enable</description>
							<bitRange>[30:30]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>hfroscrdy</name>
							<description>Ring Oscillator Ready</description>
							<bitRange>[31:31]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>hfxosccfg</name>
					<description>Crystal Oscillator Configuration and Status</description>
					<addressOffset>0x4</addressOffset>
					<fields>
						<field>
							<name>hfxoscen</name>
							<description>Crystal Oscillator Enable</description>
							<bitRange>[30:30]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>hfxoscrdy</name>
							<description>Crystal Oscillator Ready</description>
							<bitRange>[31:31]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>pllcfg</name>
					<description>PLL Configuration and Status</description>
					<addressOffset>0x8</addressOffset>
					<fields>
						<field>
							<name>pllr</name>
							<description>PLL R Value</description>
							<bitRange>[2:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>pllf</name>
							<description>PLL F Value</description>
							<bitRange>[9:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>pllq</name>
							<description>PLL Q Value</description>
							<bitRange>[11:10]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>pllsel</name>
							<description>PLL Select</description>
							<bitRange>[16:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>pllrefsel</name>
							<description>PLL Reference Select</description>
							<bitRange>[17:17]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>pllbypass</name>
							<description>PLL Bypass</description>
							<bitRange>[18:18]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>plllock</name>
							<description>PLL Lock</description>
							<bitRange>[31:31]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>plloutdiv</name>
					<description>PLL Final Divide Configuration</description>
					<addressOffset>0xC</addressOffset>
					<fields>
						<field>
							<name>plloutdiv</name>
							<description>PLL Final Divider Value</description>
							<bitRange>[5:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>plloutdivby1</name>
							<description>PLL Final Divide By 1</description>
							<bitRange>[13:8]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>procmoncfg</name>
					<description>Process Monitor Configuration and Status</description>
					<addressOffset>0xF0</addressOffset>
					<fields>
						<field>
							<name>procmon_div_sel</name>
							<description>Proccess Monitor Divider</description>
							<bitRange>[4:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>procmon_delay_sel</name>
							<description>Process Monitor Delay Selector</description>
							<bitRange>[12:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>procmon_en</name>
							<description>Process Monitor Enable</description>
							<bitRange>[16:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>procomon_sel</name>
							<description>Process Monitor Select</description>
							<bitRange>[25:24]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>sifive_gpio0_0</name>
			<description>From sifive,gpio0,control peripheral generator</description>
			<baseAddress>0x10012000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>input_val</name>
					<description>Pin value</description>
					<addressOffset>0x0</addressOffset>
				</register>
				<register>
					<name>input_en</name>
					<description>Pin input enable</description>
					<addressOffset>0x4</addressOffset>
				</register>
				<register>
					<name>output_en</name>
					<description>Pin output enable</description>
					<addressOffset>0x8</addressOffset>
				</register>
				<register>
					<name>output_val</name>
					<description>Output value</description>
					<addressOffset>0xC</addressOffset>
				</register>
				<register>
					<name>pue</name>
					<description>Internal pull-up enable</description>
					<addressOffset>0x10</addressOffset>
				</register>
				<register>
					<name>ds</name>
					<description>Pin drive strength</description>
					<addressOffset>0x14</addressOffset>
				</register>
				<register>
					<name>rise_ie</name>
					<description>Rise interrupt enable</description>
					<addressOffset>0x18</addressOffset>
				</register>
				<register>
					<name>rise_ip</name>
					<description>Rise interrupt pending</description>
					<addressOffset>0x1C</addressOffset>
				</register>
				<register>
					<name>fall_ie</name>
					<description>Fall interrupt enable</description>
					<addressOffset>0x20</addressOffset>
				</register>
				<register>
					<name>fall_ip</name>
					<description>Fall interrupt pending</description>
					<addressOffset>0x24</addressOffset>
				</register>
				<register>
					<name>high_ie</name>
					<description>High interrupt enable</description>
					<addressOffset>0x28</addressOffset>
				</register>
				<register>
					<name>high_ip</name>
					<description>High interrupt pending</description>
					<addressOffset>0x2C</addressOffset>
				</register>
				<register>
					<name>low_ie</name>
					<description>Low interrupt enable</description>
					<addressOffset>0x30</addressOffset>
				</register>
				<register>
					<name>low_ip</name>
					<description>Low interrupt pending</description>
					<addressOffset>0x34</addressOffset>
				</register>
				<register>
					<name>iof_en</name>
					<description>I/O function enable</description>
					<addressOffset>0x38</addressOffset>
				</register>
				<register>
					<name>iof_sel</name>
					<description>I/O function select</description>
					<addressOffset>0x3C</addressOffset>
				</register>
				<register>
					<name>out_xor</name>
					<description>Output XOR (invert)</description>
					<addressOffset>0x40</addressOffset>
				</register>
