FoRTE-Research/EnergyHarvestingDeviceTestbed/FE310/AES_test/bsp/design.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>sifive_i2c0_0</name>
			<description>From sifive,i2c0,control peripheral generator</description>
			<baseAddress>0x10016000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>prescale_low</name>
					<description>Clock Prescale register lo-byte</description>
					<addressOffset>0x0</addressOffset>
				</register>
				<register>
					<name>prescale_high</name>
					<description>Clock Prescale register hi-byte</description>
					<addressOffset>0x4</addressOffset>
				</register>
				<register>
					<name>control</name>
					<description>Control register</description>
					<addressOffset>0x8</addressOffset>
					<fields>
						<field>
							<name>en</name>
							<description>I2C core enable bit</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ien</name>
							<description>I2C core interrupt enable bit</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>transmit__receive</name>
					<description>Transmit and receive data byte register</description>
					<addressOffset>0xC</addressOffset>
				</register>
				<register>
					<name>command__status</name>
					<description>Command write and status read register</description>
					<addressOffset>0x10</addressOffset>
					<fields>
						<field>
							<name>wr_iack__rd_if</name>
							<description>Clear interrupt and Interrupt pending</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>wr_res__rd_tip</name>
							<description>Reserved and Transfer in progress</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>wr_res__rd_res</name>
							<description>Reserved and Reserved</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>wr_ack__rd_res</name>
							<description>Send ACK/NACK and Reserved</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>wr_txd__rd_res</name>
							<description>Transmit data and Reserved</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>wr_rxd__rd_al</name>
							<description>Receive data and Arbitration lost</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>wr_sto__rd_busy</name>
							<description>Generate stop and I2C bus busy</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>wr_sta__rd_rxack</name>
							<description>Generate start and Got ACK/NACK</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>sifive_uart0_1</name>
			<description>From sifive,uart0,control peripheral generator</description>
			<baseAddress>0x10023000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>txdata</name>
					<description>Transmit data register</description>
					<addressOffset>0x0</addressOffset>
					<fields>
						<field>
							<name>data</name>
							<description>Transmit data</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>full</name>
							<description>Transmit FIFO full</description>
							<bitRange>[31:31]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>rxdata</name>
					<description>Receive data register</description>
					<addressOffset>0x4</addressOffset>
					<fields>
						<field>
							<name>data</name>
							<description>Received data</description>
							<bitRange>[7:0]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>empty</name>
							<description>Receive FIFO empty</description>
							<bitRange>[31:31]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>txctrl</name>
					<description>Transmit control register</description>
					<addressOffset>0x8</addressOffset>
					<fields>
						<field>
							<name>txen</name>
							<description>Transmit enable</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>nstop</name>
							<description>Number of stop bits</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>txcnt</name>
							<description>Transmit watermark level</description>
							<bitRange>[18:16]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>rxctrl</name>
					<description>Receive control register</description>
					<addressOffset>0xC</addressOffset>
					<fields>
						<field>
							<name>rxen</name>
							<description>Receive enable</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>rxcnt</name>
							<description>Receive watermark level</description>
							<bitRange>[18:16]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ie</name>
					<description>UART interrupt enable</description>
					<addressOffset>0x10</addressOffset>
					<fields>
						<field>
							<name>txwm</name>
							<description>Transmit watermark interrupt enable</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>rxwm</name>
							<description>Receive watermark interrupt enable</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ip</name>
					<description>UART interrupt pending</description>
					<addressOffset>0x14</addressOffset>
					<fields>
						<field>
							<name>txwm</name>
							<description>Transmit watermark interrupt pending</description>
							<bitRange>[0:0]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>rxwm</name>
							<description>Receive watermark interrupt pending</description>
							<bitRange>[1:1]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>div</name>
					<description>Baud rate divisor</description>
					<addressOffset>0x18</addressOffset>
					<fields>
						<field>
							<name>div</name>
							<description>Baud rate divisor.</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
